app/Models/ModelKv.php

    function callKafe($id_kafe = false)
    {
        if ($id_kafe === false) {
            // Buat subquery untuk mendapatkan daftar foto kafe
            $foto_kafe_subquery = $this->db->table('tbl_foto_kafe')->select('id_kafe, GROUP_CONCAT(nama_file_foto SEPARATOR ",") as nama_foto')
                ->groupBy('tbl_foto_kafe.id_kafe')
                ->getCompiledSelect();

            // Gunakan subquery di dalam query utama
            $buidler = $this->db->table('tbl_kafe')->select('tbl_kafe.id_kafe, nama_kafe, alamat_kafe, latitude, longitude, fasilitas_kafe, instagram_kafe, tbl_provinsi.id_provinsi as id_provinsi, nama_provinsi, tbl_kabupaten.id_kabupaten as id_kabupaten, nama_kabupaten, tbl_kecamatan.id_kecamatan as id_kecamatan, nama_kecamatan, tbl_kelurahan.id_kelurahan as id_kelurahan, nama_kelurahan, created_at, updated_at, tbl_status_appv.user as user, tbl_status_appv.stat_appv as stat_appv, nama_foto')
                ->join("($foto_kafe_subquery) as tbl_foto_kafe", 'tbl_foto_kafe.id_kafe = tbl_kafe.id_kafe', 'LEFT')
                ->join('tbl_status_appv', 'tbl_status_appv.id_kafe = tbl_kafe.id_kafe')
                ->join('tbl_provinsi', 'tbl_provinsi.id_provinsi = tbl_kafe.id_provinsi')
                ->join('tbl_kabupaten', 'tbl_kabupaten.id_kabupaten = tbl_kafe.id_kabupaten')
                ->join('tbl_kecamatan', 'tbl_kecamatan.id_kecamatan = tbl_kafe.id_kecamatan')
                ->join('tbl_kelurahan', 'tbl_kelurahan.id_kelurahan = tbl_kafe.id_kelurahan')
                ->orderBy('id_kafe', 'DESC');
            $query = $buidler->getWhere(['stat_appv' => '1']);

            // Buat subquery untuk mendapatkan daftar jam operasional
            $jam_operasional_subquery = $this->db->table('tbl_jam_operasional')
                ->select('')
                ->get();
            $jam_operasional = $jam_operasional_subquery->getResult();
---
SELECT *
FROM `tbl_kafe`
JOIN `tbl_provinsi` ON `tbl_provinsi`.`id_provinsi` = `tbl_kafe`.`id_provinsi`
JOIN `tbl_kabupaten` ON `tbl_kabupaten`.`id_kabupaten` = `tbl_kafe`.`id_kabupaten`
JOIN `tbl_kecamatan` ON `tbl_kecamatan`.`id_kecamatan` = `tbl_kafe`.`id_kecamatan`
JOIN `tbl_kelurahan` ON `tbl_kelurahan`.`id_kelurahan` = `tbl_kafe`.`id_kelurahan`
WHERE `stat_appv` = '1'
SELECT *
FROM `tbl_jam_operasional`

    function callPendingData($id_kafe = false)
    {
        if ($id_kafe === false) {
            // Buat subquery untuk mendapatkan daftar foto kafe
            $foto_kafe_subquery = $this->db->table('tbl_foto_kafe')->select('id_kafe, GROUP_CONCAT(nama_file_foto SEPARATOR ",") as nama_foto')
                ->groupBy('tbl_foto_kafe.id_kafe')
                ->getCompiledSelect();

            // Gunakan subquery di dalam query utama
            $buidler = $this->db->table('tbl_kafe')->select('tbl_kafe.id_kafe, nama_kafe, alamat_kafe, latitude, longitude, fasilitas_kafe, instagram_kafe, tbl_provinsi.id_provinsi as id_provinsi, nama_provinsi, tbl_kabupaten.id_kabupaten as id_kabupaten, nama_kabupaten, tbl_kecamatan.id_kecamatan as id_kecamatan, nama_kecamatan, tbl_kelurahan.id_kelurahan as id_kelurahan, nama_kelurahan, created_at, updated_at, tbl_status_appv.user as user, tbl_status_appv.stat_appv as stat_appv, nama_foto')
                ->join("($foto_kafe_subquery) as tbl_foto_kafe", 'tbl_foto_kafe.id_kafe = tbl_kafe.id_kafe', 'LEFT')
                ->join('tbl_status_appv', 'tbl_status_appv.id_kafe = tbl_kafe.id_kafe')
                ->join('tbl_provinsi', 'tbl_provinsi.id_provinsi = tbl_kafe.id_provinsi')
                ->join('tbl_kabupaten', 'tbl_kabupaten.id_kabupaten = tbl_kafe.id_kabupaten')
                ->join('tbl_kecamatan', 'tbl_kecamatan.id_kecamatan = tbl_kafe.id_kecamatan')
                ->join('tbl_kelurahan', 'tbl_kelurahan.id_kelurahan = tbl_kafe.id_kelurahan');
            $query = $buidler->getWhere(['stat_appv' => '0']);
---
SELECT *
FROM `tbl_provinsi`
ORDER BY `id_provinsi` ASC