app/Models/ModelUser.php

SELECT `users`.`id` as `userid`, `username`, `email`, `active`, `group_id`, `name`, `created_at`, `full_name`, `user_about`
FROM `users`
JOIN `auth_groups_users` ON `auth_groups_users`.`user_id` = `users`.`id`
JOIN `auth_groups` ON `auth_groups`.`id` = `auth_groups_users`.`group_id`
ORDER BY `group_id` ASC
---
    function getUsers($id = false)
    {
        if ($id == false) {
            $db      = \Config\Database::connect();
            $builder = $db->table('users');
            $builder->select('users.id as userid, username, email, active, group_id, name, created_at,  full_name, user_about');
            $builder->join('auth_groups_users', 'auth_groups_users.user_id = users.id');
            $builder->join('auth_groups', 'auth_groups.id = auth_groups_users.group_id');
            $query = $builder->orderBy('group_id', 'ASC')->get();

INSERT INTO `users` (`username`, `full_name`, `email`, `password_hash`, `active`, `created_at`) VALUES ('user2', '', 'tsctzbvjnnmv@valanides.com', '$2y$10$RNcjqv9GQmi6Qtrqy0MEnOltUMvxSPnjSLlBsNEvZzGRYk4dj1JpK', '1', '2023-05-09 17:09:05')
---
    function addUser($addUser)
    {
        return $this->db->table('users')->insert($addUser);

INSERT INTO `auth_groups_users` (`group_id`, `user_id`) VALUES ('3', 12)
---
    function insertUser($insertUser)
    {
        return $this->db->table('auth_groups_users')->insert($insertUser);

UPDATE `users` SET `id` = '3', `username` = 'user', `full_name` = 'my name is user agent', `email` = 'lpubmeq@uniromax.com', `active` = '1', `password_hash` = '$2y$10$pFzatURuo1T/CAC7qF20POd3Fz852rrxX4Fpb.VMTytw.KYLM.6m2'
WHERE `id` = '3'
---
    public function updateUser($data, $userid)
    {
        return $this->db->table('users')->update($data, ['id' => $userid]);

UPDATE `auth_groups_users` SET `group_id` = '3', `user_id` = '3'
WHERE `user_id` = '3'
---
    public function updateRole($dataA, $userid)
    {
        return $this->db->table('auth_groups_users')->update($dataA, ['user_id' => $userid]);

SELECT "users"."id" as "userid", "username", "email", "group_id", "name", "created_at", "full_name"
FROM "users"
JOIN "auth_groups_users" ON "auth_groups_users"."user_id" = "users"."id"
JOIN "auth_groups" ON "auth_groups"."id" = "auth_groups_users"."group_id"
WHERE "created_at" BETWEEN CURRENT_TIMESTAMP - INTERVAL '60 day' AND CURRENT_TIMESTAMP
---
    function userMonth()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('users');
        $builder->select('users.id as userid, username, email, group_id, name, created_at,  full_name');
        $builder->join('auth_groups_users', 'auth_groups_users.user_id = users.id');
        $builder->join('auth_groups', 'auth_groups.id = auth_groups_users.group_id');
        $query = $builder->where("created_at BETWEEN CURRENT_TIMESTAMP - INTERVAL '30 day' AND CURRENT_TIMESTAMP")->get();

SELECT COUNT(*) AS "numrows" FROM "users"
---
    function countAllUser()
    {
        return $this->db->table('users')->countAll();

SELECT *
FROM `auth_groups`
ORDER BY `id` ASC
---
    public function allGroup()
    {
        return $this->db->table('auth_groups')->orderBy('id', 'ASC')->get()->getResultArray();