app/Models/ModelGeojson.php

SELECT *
FROM `tbl_wilayah`
---
    function callGeojson($id = false)
    {
        if ($id === false) {
            return $this->db->table('tbl_wilayah')->get();