app/Models/ModelSetting.php

    function tampilData()
    {
        return $this->Where(['id' => 1])->get();
---
SELECT *
FROM `tbl_setting`
WHERE `id` = 1