app/Models/ModelKv.php

    function callKafe($id_kafe = false)
    {
        if ($id_kafe === false) {

            return $this->db->table('tbl_kafe')->select('tbl_kafe.id_kafe, nama_kafe, alamat_kafe, latitude, longitude, instagram_kafe, tbl_provinsi.id_provinsi as id_provinsi, nama_provinsi, tbl_kabupaten.id_kabupaten as id_kabupaten, nama_kabupaten, tbl_kecamatan.id_kecamatan as id_kecamatan, nama_kecamatan, tbl_kelurahan.id_kelurahan as id_kelurahan, nama_kelurahan, created_at, updated_at, tbl_status_appv.user as user, tbl_status_appv.stat_appv as stat_appv, GROUP_CONCAT(DISTINCT nama_file_foto SEPARATOR ",") as nama_foto, GROUP_CONCAT(DISTINCT JSON_OBJECT("hari", tjo.hari, "open_time", tjo.open_time, "close_time", tjo.close_time) ORDER BY FIELD(tjo.hari, "Senin", "Selasa", "Rabu", "Kamis", "Jumat", "Sabtu", "Minggu")) AS jam_oprasional')
                ->join('tbl_foto_kafe tfk', 'tfk.id_kafe = tbl_kafe.id_kafe', 'LEFT')
                ->join('tbl_jam_operasional  tjo', 'tjo.kafe_id = tbl_kafe.id_kafe', 'LEFT')
                ->join('tbl_status_appv', 'tbl_status_appv.id_kafe = tbl_kafe.id_kafe', 'LEFT')
                ->join('tbl_provinsi', 'tbl_provinsi.id_provinsi = tbl_kafe.id_provinsi', 'LEFT')
                ->join('tbl_kabupaten', 'tbl_kabupaten.id_kabupaten = tbl_kafe.id_kabupaten', 'LEFT')
                ->join('tbl_kecamatan', 'tbl_kecamatan.id_kecamatan = tbl_kafe.id_kecamatan', 'LEFT')
                ->join('tbl_kelurahan', 'tbl_kelurahan.id_kelurahan = tbl_kafe.id_kelurahan', 'LEFT')
                ->groupBy('id_kafe, tjo.kafe_id')
                ->orderBy('id_kafe', 'DESC')
                ->getWhere(['stat_appv' => '1']);
        } else {
            return $this->db->table('tbl_kafe')->select('tbl_kafe.id_kafe, nama_kafe, alamat_kafe, latitude, longitude, instagram_kafe, tbl_provinsi.id_provinsi as id_provinsi, nama_provinsi, tbl_kabupaten.id_kabupaten as id_kabupaten, nama_kabupaten, tbl_kecamatan.id_kecamatan as id_kecamatan, nama_kecamatan, tbl_kelurahan.id_kelurahan as id_kelurahan, nama_kelurahan, created_at, updated_at, tbl_status_appv.user as user, tbl_status_appv.stat_appv as stat_appv, GROUP_CONCAT(DISTINCT nama_file_foto SEPARATOR ",") as nama_foto, GROUP_CONCAT(DISTINCT JSON_OBJECT("hari", tjo.hari, "open_time", tjo.open_time, "close_time", tjo.close_time) ORDER BY FIELD(tjo.hari, "Senin", "Selasa", "Rabu", "Kamis", "Jumat", "Sabtu", "Minggu")) AS jam_oprasional')
                ->join('tbl_foto_kafe tfk', 'tfk.id_kafe = tbl_kafe.id_kafe', 'LEFT')
                ->join('tbl_jam_operasional  tjo', 'tjo.kafe_id = tbl_kafe.id_kafe', 'LEFT')
                ->join('tbl_status_appv', 'tbl_status_appv.id_kafe = tbl_kafe.id_kafe', 'LEFT')
                ->join('tbl_provinsi', 'tbl_provinsi.id_provinsi = tbl_kafe.id_provinsi', 'LEFT')
                ->join('tbl_kabupaten', 'tbl_kabupaten.id_kabupaten = tbl_kafe.id_kabupaten', 'LEFT')
                ->join('tbl_kecamatan', 'tbl_kecamatan.id_kecamatan = tbl_kafe.id_kecamatan', 'LEFT')
                ->join('tbl_kelurahan', 'tbl_kelurahan.id_kelurahan = tbl_kafe.id_kelurahan', 'LEFT')
                ->groupBy('id_kafe, tjo.kafe_id')
                ->Where(['tbl_kafe.id_kafe' => $id_kafe])
                ->getWhere(['stat_appv' => '1']);
---
SELECT `tbl_kafe`.`id_kafe`, `nama_kafe`, `alamat_kafe`, `latitude`, `longitude`, `instagram_kafe`, `tbl_provinsi`.`id_provinsi` as `id_provinsi`, `nama_provinsi`, `tbl_kabupaten`.`id_kabupaten` as `id_kabupaten`, `nama_kabupaten`, `tbl_kecamatan`.`id_kecamatan` as `id_kecamatan`, `nama_kecamatan`, `tbl_kelurahan`.`id_kelurahan` as `id_kelurahan`, `nama_kelurahan`, `created_at`, `updated_at`, `tbl_status_appv`.`user` as `user`, `tbl_status_appv`.`stat_appv` as `stat_appv`, GROUP_CONCAT(DISTINCT nama_file_foto SEPARATOR ", ") as nama_foto, GROUP_CONCAT(DISTINCT JSON_OBJECT("hari", `tjo`.`hari`, "open_time", `tjo`.`open_time`, "close_time", tjo.close_time) ORDER BY FIELD(tjo.hari, "Senin", "Selasa", "Rabu", "Kamis", "Jumat", "Sabtu", "Minggu")) AS jam_oprasional
FROM `tbl_kafe`
LEFT JOIN `tbl_foto_kafe` `tfk` ON `tfk`.`id_kafe` = `tbl_kafe`.`id_kafe`
LEFT JOIN `tbl_jam_operasional` `tjo` ON `tjo`.`kafe_id` = `tbl_kafe`.`id_kafe`
LEFT JOIN `tbl_status_appv` ON `tbl_status_appv`.`id_kafe` = `tbl_kafe`.`id_kafe`
LEFT JOIN `tbl_provinsi` ON `tbl_provinsi`.`id_provinsi` = `tbl_kafe`.`id_provinsi`
LEFT JOIN `tbl_kabupaten` ON `tbl_kabupaten`.`id_kabupaten` = `tbl_kafe`.`id_kabupaten`
LEFT JOIN `tbl_kecamatan` ON `tbl_kecamatan`.`id_kecamatan` = `tbl_kafe`.`id_kecamatan`
LEFT JOIN `tbl_kelurahan` ON `tbl_kelurahan`.`id_kelurahan` = `tbl_kafe`.`id_kelurahan`
WHERE `stat_appv` = '1'
GROUP BY `id_kafe`, `tjo`.`kafe_id`
ORDER BY `id_kafe` DESC
SELECT "tbl_kafe".*, "tbl_provinsi"."nama_provinsi", "tbl_kabupaten"."nama_kabupaten", "tbl_kecamatan"."nama_kecamatan", "tbl_kelurahan"."nama_kelurahan", "tbl_status_appv"."user", "tbl_status_appv"."stat_appv", "tbl_status_appv"."date_updated", string_agg(DISTINCT tbl_foto_kafe.nama_file_foto, ', ') AS nama_foto, (SELECT json_agg(json_build_object('hari', "hari", 'open_time', "open_time", 'close_time', close_time))
FROM "tbl_jam_operasional"
WHERE "kafe_id" = "tbl_kafe"."id_kafe"
GROUP BY "kafe_id") AS jam_oprasional
FROM "tbl_kafe"
JOIN "tbl_provinsi" ON "tbl_provinsi"."id_provinsi" = "tbl_kafe"."id_provinsi"
JOIN "tbl_kabupaten" ON "tbl_kabupaten"."id_kabupaten" = "tbl_kafe"."id_kabupaten"
JOIN "tbl_kecamatan" ON "tbl_kecamatan"."id_kecamatan" = "tbl_kafe"."id_kecamatan"
JOIN "tbl_kelurahan" ON "tbl_kelurahan"."id_kelurahan" = "tbl_kafe"."id_kelurahan"
LEFT JOIN "tbl_status_appv" ON "tbl_status_appv"."id_kafe" = "tbl_kafe"."id_kafe"
LEFT JOIN tbl_foto_kafe ON tbl_foto_kafe.id_kafe = tbl_kafe.id_kafe
WHERE "stat_appv" = '1'
GROUP BY "tbl_kafe"."id_kafe", "tbl_provinsi"."nama_provinsi", "tbl_kabupaten"."nama_kabupaten", "tbl_kecamatan"."nama_kecamatan", "tbl_kelurahan"."nama_kelurahan", "tbl_status_appv"."user", "tbl_status_appv"."stat_appv", "tbl_status_appv"."date_updated"
ORDER BY "id_kafe" DESC
SELECT `tbl_kafe`.`id_kafe`, `nama_kafe`, `alamat_kafe`, `latitude`, `longitude`, `instagram_kafe`, `tbl_provinsi`.`id_provinsi` as `id_provinsi`, `nama_provinsi`, `tbl_kabupaten`.`id_kabupaten` as `id_kabupaten`, `nama_kabupaten`, `tbl_kecamatan`.`id_kecamatan` as `id_kecamatan`, `nama_kecamatan`, `tbl_kelurahan`.`id_kelurahan` as `id_kelurahan`, `nama_kelurahan`, `created_at`, `updated_at`, `tbl_status_appv`.`user` as `user`, `tbl_status_appv`.`stat_appv` as `stat_appv`, GROUP_CONCAT(DISTINCT nama_file_foto SEPARATOR ", ") as nama_foto, GROUP_CONCAT(DISTINCT JSON_OBJECT("hari", `tjo`.`hari`, "open_time", `tjo`.`open_time`, "close_time", tjo.close_time) ORDER BY FIELD(tjo.hari, "Senin", "Selasa", "Rabu", "Kamis", "Jumat", "Sabtu", "Minggu")) AS jam_oprasional
FROM `tbl_kafe`
LEFT JOIN `tbl_foto_kafe` `tfk` ON `tfk`.`id_kafe` = `tbl_kafe`.`id_kafe`
LEFT JOIN `tbl_jam_operasional` `tjo` ON `tjo`.`kafe_id` = `tbl_kafe`.`id_kafe`
LEFT JOIN `tbl_status_appv` ON `tbl_status_appv`.`id_kafe` = `tbl_kafe`.`id_kafe`
LEFT JOIN `tbl_provinsi` ON `tbl_provinsi`.`id_provinsi` = `tbl_kafe`.`id_provinsi`
LEFT JOIN `tbl_kabupaten` ON `tbl_kabupaten`.`id_kabupaten` = `tbl_kafe`.`id_kabupaten`
LEFT JOIN `tbl_kecamatan` ON `tbl_kecamatan`.`id_kecamatan` = `tbl_kafe`.`id_kecamatan`
LEFT JOIN `tbl_kelurahan` ON `tbl_kelurahan`.`id_kelurahan` = `tbl_kafe`.`id_kelurahan`
WHERE `tbl_kafe`.`id_kafe` = '205'
GROUP BY `id_kafe`, `tjo`.`kafe_id`

    function callPendingData($id_kafe = false)
    {
        if ($id_kafe === false) {
            return $this->db->table('tbl_kafe')->select('tbl_kafe.id_kafe, nama_kafe, alamat_kafe, latitude, longitude, instagram_kafe, tbl_provinsi.id_provinsi as id_provinsi, nama_provinsi, tbl_kabupaten.id_kabupaten as id_kabupaten, nama_kabupaten, tbl_kecamatan.id_kecamatan as id_kecamatan, nama_kecamatan, tbl_kelurahan.id_kelurahan as id_kelurahan, nama_kelurahan, created_at, updated_at, tbl_status_appv.user as user, tbl_status_appv.stat_appv as stat_appv, GROUP_CONCAT(DISTINCT nama_file_foto SEPARATOR ",") as nama_foto, GROUP_CONCAT(DISTINCT JSON_OBJECT("hari", tjo.hari, "open_time", tjo.open_time, "close_time", tjo.close_time)) AS jam_oprasional')
                ->join('tbl_foto_kafe tfk', 'tfk.id_kafe = tbl_kafe.id_kafe', 'LEFT')
                ->join('tbl_jam_operasional  tjo', 'tjo.kafe_id = tbl_kafe.id_kafe', 'LEFT')
                ->join('tbl_status_appv', 'tbl_status_appv.id_kafe = tbl_kafe.id_kafe', 'LEFT')
                ->join('tbl_provinsi', 'tbl_provinsi.id_provinsi = tbl_kafe.id_provinsi', 'LEFT')
                ->join('tbl_kabupaten', 'tbl_kabupaten.id_kabupaten = tbl_kafe.id_kabupaten', 'LEFT')
                ->join('tbl_kecamatan', 'tbl_kecamatan.id_kecamatan = tbl_kafe.id_kecamatan', 'LEFT')
                ->join('tbl_kelurahan', 'tbl_kelurahan.id_kelurahan = tbl_kafe.id_kelurahan', 'LEFT')
                ->groupBy('id_kafe, tjo.kafe_id')
                ->orderBy('id_kafe', 'DESC')
                ->getWhere(['stat_appv' => '0']);
        } else {
            return $this->Where(['id_kafe' => $id_kafe])->get();
---
SELECT *
FROM `tbl_kafe`
JOIN `tbl_provinsi` ON `tbl_provinsi`.`id_provinsi` = `tbl_kafe`.`id_provinsi`
JOIN `tbl_kabupaten` ON `tbl_kabupaten`.`id_kabupaten` = `tbl_kafe`.`id_kabupaten`
JOIN `tbl_kecamatan` ON `tbl_kecamatan`.`id_kecamatan` = `tbl_kafe`.`id_kecamatan`
JOIN `tbl_kelurahan` ON `tbl_kelurahan`.`id_kelurahan` = `tbl_kafe`.`id_kelurahan`
WHERE `stat_appv` = '0'

    function getFiveKafe()
    {
        $buidler = $this->db->table('tbl_kafe')->select('tbl_kafe.id_kafe, nama_kafe, alamat_kafe, latitude, longitude, instagram_kafe, tbl_provinsi.id_provinsi as id_provinsi, nama_provinsi, tbl_kabupaten.id_kabupaten as id_kabupaten, nama_kabupaten, tbl_kecamatan.id_kecamatan as id_kecamatan, nama_kecamatan, tbl_kelurahan.id_kelurahan as id_kelurahan, nama_kelurahan, tbl_kafe.created_at, tbl_kafe.updated_at, tbl_status_appv.stat_appv as stat_appv, tbl_status_appv.user as user, users.username as username')
            ->join('tbl_provinsi', 'tbl_provinsi.id_provinsi = tbl_kafe.id_provinsi', 'LEFT')
            ->join('tbl_kabupaten', 'tbl_kabupaten.id_kabupaten = tbl_kafe.id_kabupaten', 'LEFT')
            ->join('tbl_kecamatan', 'tbl_kecamatan.id_kecamatan = tbl_kafe.id_kecamatan', 'LEFT')
            ->join('tbl_kelurahan', 'tbl_kelurahan.id_kelurahan = tbl_kafe.id_kelurahan', 'LEFT')
            ->join('tbl_status_appv', 'tbl_status_appv.id_kafe = tbl_kafe.id_kafe', 'LEFT')
            ->join('users', 'users.id = tbl_status_appv.user')
            ->limit(5);
        $query = $buidler->getWhere(['stat_appv' => '1']);
---
SELECT *
FROM `tbl_provinsi`
ORDER BY `id_provinsi` ASC
SELECT `tbl_kafe`.`id_kafe`, `nama_kafe`, `alamat_kafe`, `latitude`, `longitude`, `fasilitas_kafe`, `instagram_kafe`, `tbl_provinsi`.`id_provinsi` as `id_provinsi`, `nama_provinsi`, `tbl_kabupaten`.`id_kabupaten` as `id_kabupaten`, `nama_kabupaten`, `tbl_kecamatan`.`id_kecamatan` as `id_kecamatan`, `nama_kecamatan`, `tbl_kelurahan`.`id_kelurahan` as `id_kelurahan`, `nama_kelurahan`, `tbl_kafe`.`created_at`, `tbl_kafe`.`updated_at`, `tbl_status_appv`.`stat_appv` as `stat_appv`, `tbl_status_appv`.`user` as `user`, `users`.`username` as `username`
FROM `tbl_kafe`
JOIN `tbl_provinsi` ON `tbl_provinsi`.`id_provinsi` = `tbl_kafe`.`id_provinsi`
JOIN `tbl_kabupaten` ON `tbl_kabupaten`.`id_kabupaten` = `tbl_kafe`.`id_kabupaten`
JOIN `tbl_kecamatan` ON `tbl_kecamatan`.`id_kecamatan` = `tbl_kafe`.`id_kecamatan`
JOIN `tbl_kelurahan` ON `tbl_kelurahan`.`id_kelurahan` = `tbl_kafe`.`id_kelurahan`
JOIN `tbl_status_appv` ON `tbl_status_appv`.`id_kafe` = `tbl_kafe`.`id_kafe`
JOIN `users` ON `users`.`id` = `tbl_status_appv`.`user`
WHERE `stat_appv` = '1'
 LIMIT 5

    function countAllKafe()
    {
        return $this->db->table('tbl_kafe')
            ->join('tbl_status_appv', 'tbl_status_appv.id_kafe = tbl_kafe.id_kafe')
            ->Where(['stat_appv' => '1'])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_kafe`
JOIN `tbl_status_appv` ON `tbl_status_appv`.`id_kafe` = `tbl_kafe`.`id_kafe`
WHERE `stat_appv` = '1'

    function countAllPending()
    {
        return $this->db->table('tbl_kafe')
            ->join('tbl_status_appv', 'tbl_status_appv.id_kafe = tbl_kafe.id_kafe')
            ->Where(['stat_appv' => '0'])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_kafe`
JOIN `tbl_status_appv` ON `tbl_status_appv`.`id_kafe` = `tbl_kafe`.`id_kafe`
WHERE `stat_appv` = '0'

    public function allProvinsi()
    {
        return $this->db->table('tbl_provinsi')->orderBy('id_provinsi', 'ASC')->get()->getResultArray();
---
SELECT *
FROM `tbl_provinsi`
ORDER BY `id_provinsi` ASC