app/Models/ModelGeojson.php

    function callGeojson($id = false)
    {
        if ($id === false) {
            return $this->db->table('tbl_features')->get();
---
SELECT *
FROM "tbl_features"