app/Models/ModelFoto.php

SELECT *
FROM `tbl_foto_kafe`
SELECT *
FROM `tbl_foto_kafe`
WHERE `id_kafe` = '205'
---
    function getFoto($id_kafe = false)
    {
        if ($id_kafe === false) {
            return $this->db->table('tbl_foto_kafe')->get();
        } else {
            return $this->db->table('tbl_foto_kafe')->Where(['id_kafe' => $id_kafe])->get();